export const MAX_NAME_LEN: number = 10;
export const MATCHING_PATTERN = {
  notMatching: 0,
  partMatching: 1,
  perfectMatching: 2,
};

export const JANNYS_NAME_LIST: string[] = [
  // SMAP
  "きむらたくや",
  "なかいまさひろ",
  "くさなぎつよし",
  "かとりしんご",
  "いながきごろう",

  // TOKIO
  "じょうしましげる",
  "こくぶんたいち",
  "ながせともや",
  "まつおかまさひろ",
  // "やまぐちたつや"

  // V6
  "さかもとまさゆき",
  "いのはらよしひこ",
  "みやけけん",
  "ながのひろし",
  "おかだじゅんいち",
  "もりたごう",

  // Kinki Kids
  "どうもとこういち",
  "どうもとつよし",

  // 嵐
  "あいばまさき",
  "さくらいしょう",
  "にのみやかずなり",
  "おおのさとし",
  "まつもとじゅん",

  // タッキー&翼
  "たきざわひであき",
  "いまいつばさ",

  // NEWS
  "こやまけいいちろう",
  "かとうしげあき",
  "ますだたかひさ",
  "てごしゆうや",
  "やましたともひさ",
  "にしきどりょう",

  // 関ジャニ∞
  "おおくらただよし",
  "しぶたにすばる",
  "まるやまりゅうへい",
  "やすだしょうた",
  "むらかみしんご",
  "よこやまゆう",

  // KAT-TUN
  "かめなしかずや",
  "うえだりゅうや",
  "なかまるゆういち",
  // 赤西仁
  // 田中くん
  // 田口

  // Hey! Say! JUMP
  "やまだりょうすけ",
  "ちねんゆうり",
  "なかじまゆうと",
  // "おかもとけいと",
  "ありおかだいき",
  "たかきゆうや",
  "いのおけい",
  "やおとめひかる",
  "やぶこうた",

  // Kis-My-Ft2
  "きたやまひろみつ",
  "せんがけんと",
  "みやたとしや",
  "よこおわたる",
  "ふじがやたいすけ",
  "たまもりゆうた",
  "にかいどうたかし",

  // A.B.C-Z
  "はしもとりょうすけ",
  "とつかしょうた",
  "かわいふみと",
  "ごせきこういち",
  "つかたりょういち",

  // ジャニーズWEST
  "しげおかだいき",
  "きりやまあきと",
  "なかまじゅんた",
  "かみやまともひろ",
  "ふじいりゅうせい",
  "はまだたかひろ",
  "こたきのぞむ",

  // King&Price
  "きしゆうた",
  "じんぐうじゆうた",
  "ひらのしょう",
  "たかはしかいと",
  "ながせれん",

  // SexyZone
  "きくちふうま",
  "さとうしょうり",
  "なかじまけんと",
  "まりうすよう",
  "まつしまそう",

  // SixTONES
  "じぇしー",
  "きょうもとたいが",
  "まつむらほくと",
  "こうちゆうご",
  "もりもとしんたろう",
  "たなかじゅり",

  // Snow Man
  "いわもとひかる",
  "ふかざわたつや",
  "らうーる",
  "わたなべしょうた",
  "むかいこうじ",
  "あべりょうへい",
  "めぐろれん",
  "みやだてりょうた",
  "さくまだいすけ",

  // なにわ男子
  "にしはただいご",
  "おおにしりゅうせい",
  "みちえだしゅんすけ",
  "たかはしきょうへい",
  "ながおけんと",
  "ふじわらじょういちろう",
  "おおはしかずや",

  // 風間俊介
  "かざましゅんすけ",
];
